Static Public Member Functions | List of all members
ACAPI::MEP::v1::CableCarrierPort Class Referencefinal
MEP Element Manager
The CableCarrierPort represents a connection point of a cable carrier. More...
#include <MEPCableCarrierPort.hpp>
 Inheritance diagram for ACAPI::MEP::v1::CableCarrierPort:
 Static Public Member Functions
static Result< CableCarrierPort >  | Get (const UniqueID &uniqueId)
Returns a CableCarrierPort.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsConnected () const
Result< bool >  | IsConnectable (const UniqueID &portId) const
Checks if the Port is connectable to another Port which has the UniqueID of the parameter.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetWidth (double width)
Sets the width of the port.
void  | SetHeight (double height)
Sets the height of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions inherited from ACAPI::MEP::v1::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl >)
Modifier (PortBase &)
Detailed Description
The CableCarrierPort represents a connection point of a cable carrier.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Member Function Documentation
◆ Get()
 static Result< CableCarrierPort > ACAPI::MEP::v1::CableCarrierPort::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a CableCarrierPort.
Parameters
uniqueId | The UniqueID of the requested CableCarrierPort.
Returns
If the uniqueId belongs to a CableCarrierPort, returns the object associated to it, otherwise Error.